avr-rust/avrd/packs/atmega/ATmega32HVBrevB.atdf
        <register caption="Battery Protection Short-current Timing Register" name="BPSCTR" offset="0xFA" size="1" mask="0x7F"/>
        <register caption="Battery Protection Charge-High-current Detection Level Register" name="BPCHCD" offset="0xF9" size="1" mask="0xFF"/>
        <register caption="Battery Protection Discharge-High-current Detection Level Register" name="BPDHCD" offset="0xF8" size="1" mask="0xFF"/>
        <register caption="Battery Protection Charge-Over-current Detection Level Register" name="BPCOCD" offset="0xF7" size="1" mask="0xFF"/>
        <register caption="Battery Protection Discharge-Over-current Detection Level Register" name="BPDOCD" offset="0xF6" size="1" mask="0xFF"/>
        <register caption="Battery Protection Short-Circuit Detection Level Register" name="BPSCD" offset="0xF5" size="1" mask="0xFF"/>
        <register caption="Battery Protection Interrupt Flag Register" name="BPIFR" offset="0xF3" size="1">
          <bitfield caption="Short-circuit Protection Activated Interrupt Flag" mask="0x10" name="SCIF"/>
          <bitfield caption="Discharge Over-current Protection Activated Interrupt Flag" mask="0x08" name="DOCIF"/>
          <bitfield caption="Charge Over-current Protection Activated Interrupt Flag" mask="0x04" name="COCIF"/>
          <bitfield caption="Disharge High-current Protection Activated Interrupt" mask="0x02" name="DHCIF"/>
          <bitfield caption="Charge High-current Protection Activated Interrupt" mask="0x01" name="CHCIF"/>
        </register>
        <register caption="Battery Protection Interrupt Mask Register" name="BPIMSK" offset="0xF2" size="1">
          <bitfield caption="Short-circuit Protection Activated Interrupt Enable" mask="0x10" name="SCIE"/>
          <bitfield caption="Discharge Over-current Protection Activated Interrupt Enable" mask="0x08" name="DOCIE"/>
          <bitfield caption="Charge Over-current Protection Activated Interrupt Enable" mask="0x04" name="COCIE"/>
          <bitfield caption="Discharger High-current Protection Activated Interrupt" mask="0x02" name="DHCIE"/>
          <bitfield caption="Charger High-current Protection Activated Interrupt" mask="0x01" name="CHCIE"/>
        </register>
      </register-group>
    </module>
    <module caption="Charger Detect" name="CHARGER_DETECT">
      <register-group caption="Charger Detect" name="CHARGER_DETECT">
        <register caption="Charger Detect Control and Status Register" name="CHGDCSR" offset="0xD4" size="1">
          <bitfield caption="BATT Pin Voltage Level" mask="0x10" name="BATTPVL"/>
          <bitfield caption="Charger Detect Interrupt Sense Control" mask="0x0C" name="CHGDISC"/>
          <bitfield caption="Charger Detect Interrupt Flag" mask="0x02" name="CHGDIF"/>
          <bitfield caption="Charger Detect Interrupt Enable" mask="0x01" name="CHGDIE"/>
        </register>
      </register-group>
    </module>
    <module caption="Voltage Regulator" name="VOLTAGE_REGULATOR">
      <register-group caption="Voltage Regulator" name="VOLTAGE_REGULATOR">
        <register caption="Regulator Operating Condition Register" name="ROCR" offset="0xC8" size="1" ocd-rw="R">
          <bitfield caption="ROC Status" mask="0x80" name="ROCS"/>
          <bitfield caption="ROC Disable" mask="0x10" name="ROCD"/>
          <bitfield caption="ROC Warning Interrupt Flag" mask="0x02" name="ROCWIF"/>
          <bitfield caption="ROC Warning Interrupt Enable" mask="0x01" name="ROCWIE"/>
        </register>
      </register-group>
    </module>
    <module caption="Bandgap" name="BANDGAP">
      <register-group caption="Bandgap" name="BANDGAP">
        <register caption="Bandgap Control and Status Register" name="BGCSR" offset="0xD2" size="1">
          <bitfield caption="Bandgap Disable" mask="0x20" name="BGD"/>
          <bitfield caption="Bandgap Short Circuit Detection Enabled" mask="0x10" name="BGSCDE"/>
          <bitfield caption="Bandgap Short Circuit Detection Interrupt Flag" mask="0x02" name="BGSCDIF"/>
          <bitfield caption="Bandgap Short Circuit Detection Interrupt Enable" mask="0x01" name="BGSCDIE"/>
        </register>
        <register caption="Bandgap Calibration of Resistor Ladder" name="BGCRR" offset="0xD1" size="1" mask="0xFF"/>
        <register caption="Bandgap Calibration Register" name="BGCCR" offset="0xD0" size="1">
          <bitfield caption="BG Calibration of PTAT Current Bits" mask="0x3F" name="BGCC"/>
        </register>
      </register-group>
    </module>
    <module caption="CPU Registers" name="CPU">
      <register-group caption="CPU Registers" name="CPU">
        <register caption="Status Register" name="SREG" offset="0x5F" size="1">
          <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
          <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
          <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
          <bitfield caption="Sign Bit" mask="0x10" name="S"/>
          <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
          <bitfield caption="Negative Flag" mask="0x04" name="N"/>
          <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
          <bitfield caption="Carry Flag" mask="0x01" name="C"/>
        </register>
        <register caption="Stack Pointer " name="SP" offset="0x5D" size="2" mask="0xFFFF"/>
        <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
          <bitfield caption="Clock Output Enable" mask="0x20" name="CKOE"/>
          <bitfield caption="Pull-up disable" mask="0x10" name="PUD"/>
          <bitfield caption="Interrupt Vector Select" mask="0x02" name="IVSEL"/>
          <bitfield caption="Interrupt Vector Change Enable" mask="0x01" name="IVCE"/>
        </register>
        <register caption="MCU Status Register" name="MCUSR" offset="0x54" size="1" ocd-rw="R">
          <bitfield caption="OCD Reset Flag" mask="0x10" name="OCDRF"/>
          <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
          <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BODRF"/>
          <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
          <bitfield caption="Power-on reset flag" mask="0x01" name="PORF"/>
        </register>
        <register caption="Fast Oscillator Calibration Value" name="FOSCCAL" offset="0x66" size="1" mask="0xFF"/>
        <register caption="Oscillator Sampling Interface Control and Status Register" name="OSICSR" offset="0x37" size="1" ocd-rw="R">
          <bitfield caption="Oscillator Sampling Interface Select 0" mask="0x10" name="OSISEL0"/>
          <bitfield caption="Oscillator Sampling Interface Status" mask="0x02" name="OSIST"/>
          <bitfield caption="Oscillator Sampling Interface Enable" mask="0x01" name="OSIEN"/>
        </register>
        <register caption="Sleep Mode Control Register" name="SMCR" offset="0x53" size="1">
          <bitfield caption="Sleep Mode Select bits" mask="0x0E" name="SM" values="CPU_SLEEP_MODE_3BITS"/>
          <bitfield caption="Sleep Enable" mask="0x01" name="SE"/>
        </register>
